In [1]:
import sqlite3 as db
import pandas as pd

In [2]:
conn = db.connect('banco_.db')
cursor = conn.cursor()

In [3]:
cursor.execute("CREATE TABLE IF NOT EXISTS employees (id INTEGER PRIMARY KEY, name TEXT, department_id INTEGER)")
cursor.execute("CREATE TABLE IF NOT EXISTS departments (id INTEGER PRIMARY KEY, name TEXT)")

In [4]:
cursor.execute("INSERT INTO employees (name, department_id) VALUES ('John Doe', 1)")
cursor.execute("INSERT INTO employees (name, department_id) VALUES ('Jane Smith', 2)")
cursor.execute("INSERT INTO employees (name, department_id) VALUES ('Robert Johnson', 2)")
cursor.execute("INSERT INTO departments (name) VALUES ('Sales')")
cursor.execute("INSERT INTO departments (name) VALUES ('Marketing')")

In [5]:
conn.commit()

In [8]:
employees = pd.read_sql_query ("select * from employees",conn)

In [9]:
employees

   id            name  department_id
0   1        John Doe              1
1   2      Jane Smith              2
2   3  Robert Johnson              2

In [10]:
query = """
    SELECT employees.name, departments.name 
    FROM employees
    INNER JOIN departments ON employees.department_id = departments.id
    """
cursor.execute(query)

In [12]:
result = cursor.fetchall()
result

[('John Doe', 'Sales'),
 ('Jane Smith', 'Marketing'),
 ('Robert Johnson', 'Marketing')]

In [13]:
pd.read_sql_query("""
    SELECT employees.name as employee, departments.name as department
    FROM employees
    INNER JOIN departments ON employees.department_id = departments.id
    """, conn)

         employee department
0        John Doe      Sales
1      Jane Smith  Marketing
2  Robert Johnson  Marketing

In [14]:
pd.read_sql_query("""
    SELECT employees.name as employee, departments.name as department
    FROM employees
    LEFT JOIN departments ON employees.department_id = departments.id
    """, conn)

         employee department
0        John Doe      Sales
1      Jane Smith  Marketing
2  Robert Johnson  Marketing